## Plan Result (prod_enterprise)




<pre><code>Plan: 38 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.reservation_purchaser[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser[&#34;Security&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["CFT"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:CFT)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["CFT-NonProd"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:CFT-NonProd)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["CFT-Prod"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:CFT-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["CFT-Sandbox"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:CFT-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["Crime"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:Crime)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["HMCTS"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:HMCTS)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["Heritage"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:Heritage)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["Heritage-NonProd"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:Heritage-NonProd)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["Heritage-Prod"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:Heritage-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["Heritage-Sandbox"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:Heritage-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["Platform"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:Platform)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["Platform-NonProd"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:Platform-NonProd)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["Platform-Prod"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:Platform-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["Platform-Sandbox"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:Platform-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["SDS"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:SDS)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["SDS-NonProd"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:SDS-NonProd)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["SDS-Prod"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:SDS-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["SDS-Sandbox"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:SDS-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.reservation_purchaser["Security"] will be created
  + resource "azuread_group" "reservation_purchaser" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Reservation Purchaser (mg:Security)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["CFT"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["CFT-NonProd"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["CFT-Prod"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["CFT-Sandbox"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["Crime"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Crime"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["HMCTS"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["Heritage"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["Heritage-NonProd"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["Heritage-Prod"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["Heritage-Sandbox"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["Platform"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["Platform-NonProd"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["Platform-Sandbox"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["SDS"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["SDS-NonProd"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["SDS-Sandbox"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.reservation_purchaser["Security"] will be created
  + resource "azurerm_role_assignment" "reservation_purchaser" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reservation Purchaser"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Security"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 38 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":107,"Program":"tfcmt","SHA1":"","Target":"prod_enterprise","Vars":{}} -->